Revit 2024 API
ViewportPositioning Enumeration
 An enumerated type listing of viewport positioning options on the sheet when swapped to another view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Since: 2023
Syntax
C#
public enum ViewportPositioning
Visual Basic
Public Enumeration ViewportPositioning
Visual C++
public enum class ViewportPositioning
Members
Member name | Description
ViewportCenter |  When swapping to another view, the center of the viewport will be maintained.
ViewOrigin |  When swapping to another view, the viewport location will be based on the view origin.
See Also
Autodesk.Revit.DB Namespace